// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
function sizerectangle (a, b){
    return a * b;
}

// - створити функцію яка обчислює та повертає площу кола з радіусом r
function sizeradius (r){
    return  Math.PI * (r*r) ;
}

// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
function cilindersize (h, r){
     return 2 * Math.PI * (h+r);
}

// - створити функцію яка приймає масив та виводить кожен його елемент
function masivcach (arr){
    for (const item of arr){
        console.log('item:', item)
    }
    masivcach([1,2, 'aaa'])
}
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
function creatp (text){
    document.write(`<p>${text}/p>`)
}
creatp(text:'Blalvlvlvlv');
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
function makeul (text){
    document.write(`
    <ul>
        <li>${text}</li>
        <li>${text}</li>
        <li>${text}</li>
    </ul>
`);
}
makeul(text: '22');
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
function makeul1 (text){
    document.write(`
    <ul>
        <li>${text}</li>
        <li>${text}</li>
        <li>${text}</li>
    </ul>
`);
}
makeul(text: '22');
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію sum(arr)яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад sum([1,2,10]) //->13
// - створити функцію swap(arr,index1,index2). Функція міняє місцями заняення у відаовідних індексах
// Приклад  swap([11,22,33,44],0,1) //=> [22,11,33,44]
// - Написати функцію обміну валюти exchange(sumUAH,currencyValues,exchangeCurrency)
// Приклад exchange(10000,[{currency:'USD',value:40},{currency:'EUR',value:42}],'USD') // => 250